var age = prompt('Ââåäèòå ãîä', 2017);

var message = (age > 0 && age < 101) ? '1' :
  (age > 100 && age < 201) ? '2' :
  (age > 200 && age < 301) ? '3' :
  (age > 300 && age < 401) ? '4' :
  (age > 400 && age < 501) ? '5' :
  (age > 500 && age < 601) ? '6' :
  (age > 600 && age < 701) ? '7' :
  (age > 700 && age < 801) ? '8' :
  (age > 800 && age < 901) ? '9' :
  (age > 900 && age < 1001) ? '10' :
  (age > 1000 && age < 1101) ? '11' :
  (age > 1100 && age < 1201) ? '12' :
  (age > 1200 && age < 1301) ? '13' :
  (age > 1300 && age < 1401) ? '14' :
  (age > 1400 && age < 1501) ? '15' :
  (age > 1500 && age < 1601) ? '16' :
  (age > 1600 && age < 1701) ? '17' :
  (age > 1700 && age < 1801) ? '18' :
  (age > 1800 && age < 1901) ? '19' :
  (age > 1900 && age < 2001) ? '20' :
  (age > 2000 && age <= 2017) ? '21' :
  'Ãîä óêàçàí íåïğàâèëüíî';

alert( message );